Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་བཀའི་མཇུག་ཁོ་ནར་སྐྲ་བྱི་བ་དང་སྣམ་སྦྱར་གྱོན་པར་གྱུར་ཏེ།
en: It was only after the Blessed One had said this that their hair fell out and they were clothed in robes,

source: སྐྲ་དང་ཁ་སྤུ་ཞག་བདུན་སྐྱེས་པ་ཙམ་དང་། ལག་པ་ན་ལྷུང་བཟེད་དང་བྱ་མ་བུམ་ཐོགས་པ་དང་།
en: with but a week’s worth of hair and beard, alms bowl and water pitcher in hand.

source: དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པའི་སྤྱོད་ལམ་ལྟ་བུར་གནས་པར་གྱུར་ཏོ། །
en: Having completed their approach to monkhood, they stood with the deportment of monks who had been ordained for one hundred years.

source: ཡང་སྨྲས་པ། དེ་བཞིན་གཤེགས་པས་ཚུར་ཤོག་བཀའ་སྩལ་པས། །སྐྲ་བྱི་སྣམ་སྦྱར་གྱོན་པའི་ལུས་ལྡན་ཞིང་། །མོད་ལ་དབང་པོ་རབ་ཞིར་གནས་གྱུར་ཏེ། །
en: As was said, Hair tonsured and body clad in robes From the Tathāgata’s call to come forth, That moment, their senses were perfectly stilled

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་གདམས་ངག་སྩལ་ནས།
en: The Blessed One gave them instructions,

source: དེ་དག་གིས་བརྩོན་པ་དང་། འབད་པ་དང་། བརྩལ་བས་
en: to which they applied themselves with diligence, effort, and exertion,

source: རིག་པས་སྒོ་ངའི་སྦུབས་དྲལ་བར་གྱུར་ཅིང་
en: and whose knowledge had rent open the shell.

source: སྲིད་པ་དང་། འདོད་པའི་རྙེད་པ་དང་། བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ།
en: They turned their backs on worldly gain, desires,

source: དབང་པོ་དང་། ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ།
en: and esteem, and were revered, honored, and praised by Indra and the gods who attend him.

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོས་ཞུས་པ།
en: The venerable Saṅgharakṣita asked the Blessed Buddha,

source: བཙུན་པ་འདི་ན་བདག་གིས་སེམས་ཅན་རྩིག་པ་འདྲ་བ་དག་དང་། ཀ་བ་འདྲ་བ་དག་དང་། ཤིང་ལྗོན་པ་འདྲ་བ་དག་དང་།
en: “Reverend, I have seen beings shaped like walls, pillars, trees,

source: ལོ་མ་འདྲ་བ་དག་དང་། མེ་ཏོག་འདྲ་བ་དག་དང་། འབྲས་བུ་འདྲ་བ་དག་དང་། ཐག་པ་འདྲ་བ་དག་དང་།
en: leaves, flowers, fruit, rope,

source: ཕྱགས་མ་འདྲ་བ་དག་དང་། ཕོར་པ་འདྲ་བ་དག་དང་། གཏུན་འདྲ་བ་དག་དང་། ཕྲུ་བ་འདྲ་བ་དག་དང་།
en: brooms, bowls, mortars and pestles,

source: རྐེད་པ་ཆད་པ་ཆུ་རྒྱུས་ཀྱིས་བཟུང་བ་མཐོང་ན།
en: and pots, as well as beings cut at the waist, their bodies held together by tendons.

source: བཙུན་པ་དེ་དག་གིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་དེ་འདྲ་བ་དག་ཏུ་གྱུར། །
en: Reverend, what actions did they perform for it to ripen in such ways?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་འདུན་འཚོ་སེམས་ཅན་དེ་དག་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ།
en: “Saṅgharakṣita,” replied the Blessed One, “those being themselves performed the actions

source: རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ། འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ། གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསྩགས་པས་དེ་དག་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་
en: —which have accrued a heap of karma, whose results have matured, which follow their course like an irrigation channel, which inevitably come to be

source: བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར། །
en: —so who else will experience the actions they themselves have performed and accrued?

source: དགེ་འདུན་འཚོ་ལས་བྱས་ཤིང་བསགས་པ་དག་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: “Saṅgharakṣita, actions which have been performed and accrued do not ripen upon the external elements.

source: ཆུའི་ཁམས་ལ་མི་འགྱུར། མེའི་ཁམས་ལ་མི་འགྱུར། རླུང་གི་ཁམས་ལ་མི་འགྱུར།
en: They do not ripen upon the element of water, upon the element of fire, nor upon the element of wind.

source: ཟིན་པའི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ།
en: fruition upon the aggregates, elements, and seats of the senses of the one who performed them, for:

source: ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས། །རྙེད་ན་ལུས་ཅན་རྣམས་ལ་ནི། །འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད།
en: When the time and the conditions Are right, they alight upon embodied beings.

source: དགེ་འདུན་འཚོ་སྔོན་བྱུང་པ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་
en: “Saṅgharakṣita, in a time now passed, during this fortunate eon, when the lifespan of beings was twenty thousand years,

source: སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། །
en: a teacher, a tathāgata, an arhat, a perfectly awakened buddha, a knowledgeable and venerable one, a sugata, one who knew the world,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: an unsurpassed guide who tamed beings, a teacher to gods and men.

source: དེ་བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་པ་ན་དེ་དག་དེའི་ཉན་ཐོས་སུ་གྱུར་ཏོ། །
en: Those beings you saw were his disciples when he lived and dwelt in the Ṛṣipatana Deer Park near Vārāṇasī.

source: དགེ་འདུན་འཚོ་ཁྱོད་ཀྱིས་སེམས་ཅན་རྩིག་པ་འདྲ་བ་གང་དག་མཐོང་བ་དེ་དག་ནི་དགེ་སློང་དག་ཏུ་གྱུར་པ་ན།
en: “Saṅgharakṣita, when those beings you saw who were shaped like walls were monks,

source: དེ་དག་གིས་དགེ་འདུན་གྱི་རྩིག་པ་མཆིལ་མས་མ་རུང་བར་བྱས་པས་
en: they defaced a wall belonging to the saṅgha with their spit.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཀ་བ་འདྲ་བ་གང་དག་མཐོང་བ་དེ་དག་ཀྱང་དགེ་སློང་དག་ཏུ་གྱུར་པ་ན།
en: “When those beings you saw who were shaped like pillars were monks,

source: དེ་དག་གིས་དགེ་འདུན་གྱི་ཀ་བ་སྣབས་ཀྱིས་མ་རུང་བར་བྱས་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཀ་བ་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ། །
en: they defaced a pillar belonging to the saṅgha with their mucus. As the fruition of that act , they have come to resemble pillars.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཤིང་ལྗོན་པ་འདྲ་བ་དག་དང་། ལོ་མ་འདྲ་བ་དག་དང་། མེ་ཏོག་འདྲ་བ་དག་དང་། འབྲས་བུ་འདྲ་བ་གང་དག་མཐོང་བ་དེ་དག་ཀྱང་དགེ་སློང་དག་ཏུ་གྱུར་པ་ན།
en: “When those beings you saw who were shaped like trees, leaves, flowers, and fruit were monks,

source: དེ་དག་གིས་དགེ་འདུན་གྱི་ཤིང་ལྗོན་པ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དག་གང་ཟག་གི་ལོངས་སྤྱོད་དུ་སྤྱད་པས་
en: they used trees, leaves, flowers, and fruit belonging to the saṅgha for their own ends.

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་ཤིང་ལྗོན་པ་འདྲ་བ་དག་དང་། ལོ་མ་འདྲ་བ་དག་དང་། མེ་ཏོག་འདྲ་བ་དག་དང་། འབྲས་བུ་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ། །
en: As the fruition of that act , they have come to resemble trees, leaves, flowers, and fruit.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཐག་པ་འདྲ་བ་དག་དང་། ཕྱགས་མ་འདྲ་བ་དག་མཐོང་བ་དེ་དག་ཀྱང་དགེ་སློང་དག་ཏུ་གྱུར་པ་ན། །
en: “When those beings you saw who were shaped like rope and brooms were monks, they used rope and brooms belonging to the saṅgha for their own ends.

source: དེ་དག་གིས་དགེ་འདུན་གྱི་ཐག་པ་དང་ཕྱགས་མ་གང་ཟག་གིས་ལོངས་སྤྱོད་དུ་སྤྱད་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཐག་པ་འདྲ་བ་དག་དང་། ཕྱགས་མ་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ། །
en: As the fruition of that act , they have come to resemble rope and brooms.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཕོར་པ་འདྲ་བ་དག་གང་དག་མཐོང་བ་དེ་དག་ནི་
en: “When those beings you saw who were shaped like bowls

source: དགེ་ཚུལ་སྐོམ་གྱི་གཙང་སྦྱོར་དུ་གྱུར་པ་ན་དེ་དག་ཕོར་པ་འཁྲུ་བར་བྱེད་པའི་ཚེ།
en: were monks, they were in charge of providing clean drinking water.

source: དགེ་སློང་གློ་བུར་དུ་འོངས་པ་དག་ལྷགས་ནས་དེ་དག་གིས་དགེ་ཚུལ་དེ་དག་ལ་དྲིས་པ། །
en: When they were washing the bowls, some visiting monks arrived and asked the monks,

source: དགེ་ཚུལ་དག་ཅི་དགེ་འདུན་ལ་སྐོམ་འབྱུང་བར་འགྱུར་རམ།
en: ‘Do novices get whatever drinks are provided to the saṅgha?’

source: དགེ་ཚུལ་དེ་དག་སེར་སྣས་དཀྲིས་ཏེ་
en: “Seized by stinginess towards the novices,

source: སྨྲས་པ། ཁོ་བོ་ཅག་གིས་ཕོར་པ་བཀྲུས་པ་མ་མཐོང་ངམ། སྐོམ་འཐུངས་ཟིན་ཏོ།
en: they replied, ‘Do you not see we are washing the bowls? The drinks have already been drunk.’

source: དེ་དག་གིས་བསམས་པ། དུས་ཡོལ་བ་ལྟ་སྙམ་ནས། རེ་བ་མེད་པར་གྱུར་ཏེ་བཞིན་གྱུར་ཅིང་ཉམས་ཏེ་
en: “The novices thought, ‘It would seem we are too late,’ and left dispirited, with expressions of resignation.

source: དོང་བས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕོར་པ་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ། །
en: As the fruition of that act , those monks have come to resemble bowls.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་གཏུན་འདྲ་བ་གང་དག་མཐོང་བ་དེ་དག་ཀྱང་དགེ་སློང་དག་ཏུ་གྱུར་པ་ན།
en: “When those beings you saw who were shaped like mortars and pestles were monks,

source: དེ་དག་ལ་ལྷུང་བཟེད་ཀྱི་ལས་དག་བྱུང་ནས་དེ་ན་དགེ་ཚུལ་དགྲ་བཅོམ་པ་ཅིག་དམ་ཞག་པར་བསྐོས་པ་དེ་ལ་དེ་དག་གིས་སྨྲས་པ།
en: they were in charge of begging bowls and they said to an arhat novice who had at the time been appointed keeper of the seals,

source: དགེ་ཚུལ་ཁོ་བོ་ཅག་ལ་གཏུན་དུ་འབྲུ་མར་གྱི་ཚིགས་མ་ཉུང་བ་ཞིག་རྡུངས་ཏེ་
en: ‘Novice, we have quite a bit of grain to grind in the mortar,

source: དེས་སྨྲས་པ། གནས་བརྟན་དག་བདག་བྲེལ་གྱིས་རེ་ཞིག་ཡུད་ཙམ་ཞིག་གཞེས་ཤིག་དང་། སླད་ཀྱིས་གསོལ་ལོ། །
en: “The arhat novice replied, ‘Elders, I’m busy at the moment. Please wait a bit. I shall give it to you later.’

source: དེ་དག་མི་བཟོད་པ་སྐྱེས་ནས་ཀུན་ནས་དཀྲིས་པ་དྲག་པོས་སྨྲས་པ།
en: “Feeling impatient, the monks became enraged and said,

source: དགེ་ཚུལ་གལ་ཏེ་ཁོ་བོ་ཅག་གཏུན་ལ་རེག་ཏུ་རུང་ན་ཁོ་བོ་ཅག་གིས་ཁྱོད་ཉིད་གཏུན་དུ་བཅུག་སྟེ།
en: ‘Novice, if we wanted to use the mortar, we could toss you into the mortar and grind you too!

source: བརྡུང་བར་ཡང་བྱ་ན། འབྲུ་མར་ཚིགས་མ་ཉུང་ཞིག་ལྟ་ཅི་སྨོས།
en: To say nothing of a bit of grain!’

source: དགེ་ཚུལ་དེས་བསམས་པ། འདི་དག་ཀུན་ནས་དཀྲིས་པ་དྲག་པོས་དཀྲིས་པས་
en: “The arhat novice thought, ‘They are enraged.

source: གལ་ཏེ་བདག་གིས་འདི་དག་ལ་ལན་བཏབ་ན་ལྷག་པར་ཡང་རབ་ཏུ་འཁྲུགས་པར་འགྱུར་རོ་སྙམ་ནས།
en: If I respond to them, it will only inflame their anger further,’

source: དེས་ཅང་མི་སྨྲ་བར་བསྡད་ནས་གང་གི་ཚེ་དེ་དག་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་བ་དེའི་ཚེ་ན་གན་དུ་སོང་སྟེ་
en: so he remained silent. “After a time their rage passed, and when it did he went to them

source: སྨྲས་པ། གནས་བརྟན་དག་ཁྱེད་ཀྱིས་བདག་སུ་ལགས་པ་མཁྱེན་ཏམ།
en: and said, ‘Elders, do you know who I am?’

source: དེ་དག་གིས་སྨྲས་པ། ཤེས་ཏེ། ཁྱོད་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་ཚུལ་ཡིན་ནོ། །
en: “They replied, ‘Yes, we know. You are but a novice who has gone forth for the perfectly awakened Buddha Kāśyapa.

source: ཁོ་བོ་ཅག་ཀྱང་དགེ་སློང་ཡིན་ནོ། །
en: We, however, are monks.’

source: གནས་བརྟན་དག་གལ་ཏེ་དེ་ལྟར་ལགས་ཀྱིས་ཀྱང་འདི་ལྟར་བདག་གིས་ནི་རབ་ཏུ་བྱུང་བས་བགྱི་བ་གང་ལགས་པ་དེ་བགྱིས་སོ།
en: ‘Elders, though that is so, since going forth, I have done all that needed to be done.

source: ཅི་ཞིག་བྱས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བགྱིས་སོ། །
en: What is that? I have abandoned all disturbing emotions and actualized arhatship.

source: ཁྱེད་ནི་འཆིང་བ་མཐའ་དག་གིས་བཅིངས་པ་ལགས་ལ། བདག་ནི་འཆིང་བ་མཐའ་དག་ལས་ངེས་པར་གྲོལ་བ་ལགས་ན།
en: While you are bound by all bonds, I have been definitively freed from all bonds.

source: ཁྱེད་ཀྱིས་ངག་གི་ལས་རྩུབ་པོ་བརྗོད་ཀྱིས་སྡིག་པ་སྡིག་པ་ལས་ཤོགས་ཤིག་དང་། །
en: As you have spoken harshly, you must confess your wrongs as wrong!

source: དེ་ལྟར་ན་ལས་བསྲབས་པ་ཉིད་དང་། ཡོངས་སུ་ཟད་པ་དང་། ཡོངས་སུ་མཐར་ཐུག་པར་འགྱུར་རོ།
en: Doing so will wither away the act , exhaust it, and finally put it to rest.’

source: དེ་དག་གིས་སྡིག་པ་སྡིག་པ་ལས་བཤགས་ཀྱང་ལས་དེའི་རྣམ་པར་སྨིན་པས་གཏུན་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ། །
en: “Although the monks confessed their wrongs as wrong, the actions came to fruition, causing them to resemble mortars and pestles.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་ཕྲུ་བ་འདྲ་བ་གང་དག་མཐོང་བ་དེ་དག་ནི་དགེ་འདུན་རྣམས་ལ་རིམ་གྲོར་བྱེད་པའི་ལྷ་འབངས་སུ་གྱུར་ཏེ།
en: “Those beings you saw who were shaped like pots were formerly bondmen in the service of the saṅgha.

source: དེ་དག་སྨན་སྐོལ་བར་བྱེད་པ་ན། དགེ་སློང་རྣམས་ཀྱིས་མི་སྙན་པར་སྨྲས་པ་དང་།
en: Once as they were boiling medicinal herbs, the monks spoke offensively to them,

source: དེ་དག་སེམས་རབ་ཏུ་ཁྲོས་པས་ཕྲུ་བ་དེ་དག་བཅག་པས། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྲུ་བ་འདྲ་བ་དག་ཏུ་གྱུར་ཏོ།
en: whereupon they broke the pots in anger. As the fruition of that act , they have come to resemble pots.

source: ཁྱོད་ཀྱིས་སེམས་ཅན་རྐེད་པ་ཆད་པ་ཆུ་རྒྱུས་ཀྱིས་བཟུང་བ་གང་དག་མཐོང་བ་
en: “And when the beings you saw who were cut at the waist, their bodies held together by tendons,

source: དེ་དག་ཀྱང་དགེ་སློང་རྙེད་པ་སྟོབས་པ་དག་ཏུ་གྱུར་པ་ན།
en: were monks in charge of supplies,

source: དེ་དག་སེར་སྣས་ཟིལ་གྱིས་ནོན་པས་རྙེད་པ་བསྒྱུར་ཏེ། དབྱར་གྱི་རྙེད་པ་གང་ཡིན་པ་དེ་ནི་དགུན་གྱིར་བསྒྱུར།
en: hey were overcome by stinginess and switched supplies, swapping the summer supplies with those for the winter and switching the winter supplies with those for the summer.

source: དགུན་གྱི་རྙེད་པ་གང་ཡིན་པ་དེ་ནི་དབྱར་གྱིར་བསྒྱུར་བས་ལས་དེའི་རྣམ་པར་སྨིན་པས་རྐེད་པ་ཆད་པ་ཆུ་རྒྱུས་ཀྱིས་བཟུང་བ་དག་ཏུ་གྱུར་ཏོ། །
en: As the fruition of that act , they have become beings cut at the waist, their bodies held together by tendons.”

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོས་ལས་ཅི་ཞིག་བགྱིས་ན།
en: “Reverend, what is it that Saṅgharakṣita has done,

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་པ་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བའི་ཁྱིམ་དུ་སྐྱེས་ཤིང་
en: that the ripened fruit of that action has led him to be born into a rich household with ample wealth and possessions,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བགྱིས་པ་དང་། གདུལ་བའི་དོན་ཆེན་པོ་བགྱིས་པར་གྱུར།
en: to actualize arhatship, and to inspire the conversion of so many?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགེ་འདུན་འཚོ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ།
en: “Monks,” replied The Blessed One, “Saṅgharakṣita himself performed the actions—which have accrued a heap of karma,

source: རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ། འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ། །
en: whose results have matured, which follow their course like an irrigation channel,

source: གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསགས་པས། དགེ་སློང་དགེ་འདུན་འཚོ་འདི་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: which inevitably come to be—so who else will experience the actions he himself has performed and accrued?

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་
en: “Monks, in a time now passed, during this fortunate eon, when the lifespan of beings was twenty thousand years,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: an unsurpassed guide who tamed beings, a teacher to gods and men.

source: དེའི་བསྟན་པ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་ཞལ་ཏ་བྱེད་པར་གྱུར་ཅིང་དེ་ལ་ལྷན་ཅིག་གནས་པ་ལྔ་བརྒྱ་ཡོད་པར་གྱུར་ཏོ། །
en: Saṅgharakṣita went forth into his teachings and served as a custodian, living together with five hundred others.

source: རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེ་ཡང་ཕལ་ཆེར་དེ་ལ་མངོན་པར་དད་པར་གྱུར་ཏོ། །
en: “Most of the community of people who lived in that hilly fastness came to have great faith in him.

source: དེ་ནས་དེས་ཚེ་ཇི་སྲིད་པར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་ན་ཡོན་ཏན་གྱི་ཚོགས་འགའ་ཡང་མ་ཐོབ་བོ། །
en: Though he lived purely his entire life he never attained any of the store of qualities.

source: དེ་དུས་གཞན་ཞིག་ན་ན་བར་གྱུར་ནས་དེ་ལ་རྩ་བ་དང་། སྡོང་བུ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་།
en: Then one day he fell ill and though he was ministered to with medicinal roots, stalks, leaves, flowers,

source: འབྲས་བུའི་སྨན་དག་གིས་བསྙེན་བཀུར་བྱས་ཀྱང་ནད་དེ་ཉེ་བར་ཞི་བར་མ་གྱུར་ཅིང་ཉམ་དམས་ནས་དེ་འཆི་བའི་དུས་ཀྱི་ཚེ་སྨོན་ལམ་འདི་སྐད་ཅེས།
en: and fruits, the illness would not subside. In despair, as he was dying, he made this prayer:

source: བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་གནས་བླ་ན་མེད་པ་འོད་སྲུང་ལ་ཚེ་ཇི་སྲིད་པར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་ན་
en: ‘Though I have spent my entire life living the holy life under Kāśyapa, the blessed tathāgata, perfectly awakened Buddha, and unsurpassed object of veneration,

source: བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་
en: ‘Young brahmin, in the future, when the lifespan of beings is one hundred years, you will become the tathāgata,

source: དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: the arhat, the perfectly awakened Buddha, the knowledgeable and venerable one,

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: the sugata, the one who knows the world, the unsurpassed guide who tames beings,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་གདབ་པར་བརྩམས་སོ།
en: and go on to abandon all disturbing emotions and actualize arhatship.’

source: དེ་ནས་དེའི་ལྷན་ཅིག་གནས་པ་དག་ལྷགས་ཏེ་
en: “The monk caretaker’s wards then approached him and

source: དྲིས་པ། མཁན་པོས་ཡོན་ཏན་གྱི་ཚོགས་ཅུང་ཟད་བརྙེས་པ་མཆིས་སམ། །
en: asked, ‘Preceptor, have you attained any of the store of qualities?’

source: དེས་སྨྲས་པ་མེད་དོ། །དེ་དག་གིས་དྲིས་པ། སྨོན་ལམ་ཇི་སྐད་བཏབ། དེས་སྨྲས་པ། འདི་དང་འདི་སྐད་ཅེས་སོ། །
en: ‘No, I have not,’ he replied. “They asked, ‘What prayers have you made?’ “He replied by explaining the prayer he had made.

source: བདག་ཅག་ཀྱང་དགེ་བའི་བཤེས་གཉེན་མཁན་པོ་ལ་བརྟེན་ནས་
en: ‘May we too, by taking you, our preceptor, as our spiritual guide,

source: བཅོམ་ལྡན་འདས་དེ་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་
en: go forth into the teachings of that very Blessed One

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་པར་གྱུར་ཅིག །
en: and go on to abandon all disturbing emotions and actualize arhatship.’

source: དགེ་སློང་དག་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་དགེ་འདུན་འཚོ་འདི་ཉིད་ཡིན་ནོ། །
en: “Monks, the monk who served as monk caretaker in that life was none other than the monk Saṅgharakṣita.

source: དེའི་ལྷན་ཅིག་གནས་པ་ལྔ་བརྒྱ་པོ་གང་དག་ཡིན་པ་དེ་དག་ནི་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་ཡིན་ནོ། །
en: His five hundred wards are none other than these five hundred seers.

source: རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་གང་ཡིན་པ་དེ་དག་ནི་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་དག་ཡིན་ནོ། །
en: The community of people who lived in that hilly fastness are none other than the five hundred merchants.

source: འདིས་དེར་ཆོས་དང་ལྡན་པས་ཞལ་ཏ་བྱས་པ་གང་ཡིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བའི་ཁྱིམ་དུ་སྐྱེས་སོ།
en: Hence, now the ripened fruit of the venerable custodian’s action has led him to be born into a rich household with ample wealth and possessions.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་སྨོན་ལམ་བཏབ་པ་དེས་ནི་
en: The prayers he made as he lay dying

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་ཤིང་གདུལ་བའི་དོན་ཆེན་པོ་བྱས་པར་གྱུར་ཏོ། །
en: have led to his abandoning all disturbing emotions, actualizing arhatship, and inspiring such a massive conversion.

source: དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་རྣམས་སྤངས་ཏེ་ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ལ་བཙལ་བར་བྱ་སྟེ།
en: Monks, therefore abandon wholly negative and mixed actions and seek wholly positive actions.

source: བཙུན་པ་ཀླུ་གཞོན་ནུ་སྤྲུལ་པས་དང་པོ་གང་དུ་དད་པ་ཐོབ་པར་གྱུར།
en: “Reverend, how did the youthful, shape-shifting nāga first gain faith?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན།
en: The Blessed One replied, “Monks, during this fortunate eon, when the lifespan of beings was twenty thousand years,

source: ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: the Blessed Buddha Kāśyapa appeared in the world,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ
en: an unsurpassed guide who tamed beings, a teacher to gods and men.

source: དེ་དགེ་སློང་ཉི་ཁྲིའི་འཁོར་དང་། བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ། །
en: He lived and dwelt with a following of twenty thousand monks in the Ṛṣipatana Deer Park near Vārāṇasī.

source: དེ་ཉན་ཐོས་རྣམས་ལ་དགེ་སློང་དག་དགོན་པ་དང་། ཤིང་དྲུང་དང་།
en: He taught the Dharma to his disciples, saying, ‘Monks, make your beds in forests and at the foot of trees;

source: ཁྱིམ་གྱིས་སྟོང་པ་དང་། རི་སུལ་དང་། རི་ཕུག་དང་། རྩ་སྤྱིལ་དང་།
en: in uninhabited places, mountain basins, mountain caves, and huts of straw;

source: བླ་གབ་མེད་པ་དང་། དུར་ཁྲོད་དང་། ནགས་ཁྲོད་དང་། རི་དྲུང་དང་། བས་མཐའི་གནས་མལ་འདི་དག་ཏུ་བསམ་གཏན་གྱིས་ཤིག །
en: in the open, in charnel grounds, in jungles, at the foot of mountains, and at the edges of forests, and there practice meditation.

source: དགེ་སློང་དག་བག་ཡོད་པར་སྒྲུབས་ལ་ཕྱིས་འགྱོད་པར་མི་འགྱུར་བར་གྱིས་ཤིག །
en: Monks, apply yourselves conscientiously and be sure you will have no regrets later.

source: འདི་ནི་ངའི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ཡིན་ནོ་ཞེས་ཆོས་སྟོན་པར་མཛད་དོ། །
en: These are my instructions and my guidance.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: “After the Blessed One said this to the monks,

source: དགེ་སློང་རྣམས་དགོན་པ་དང་། ཤིང་དྲུང་དང་།
en: the monks went to make their bed in forests and at the foot of trees;

source: བླ་གབ་མེད་པ་དང་། དུར་ཁྲོད་དང་། ནགས་ཁྲོད་དང་། རི་དྲུང་དང་། བས་མཐའི་གནས་མལ་དག་ཏུ་ཞུགས་སོ། །
en: in the open, in charnel grounds, in jungles, at the foot of mountains, and and at the edges of forests.

source: ཁ་ཅིག་ནི་རི་རབ་ཀྱི་བང་རིམ་ན་བསམ་གཏན་བྱེད།
en: Some practiced meditation on the slopes of Sumeru.

source: ཁ་ཅིག་ནི་གསེར་གྱི་རི་བདུན་པོ་དག་ན།
en: Some practiced meditation on the seven golden mountains,

source: ཁ་ཅིག་ནི་མཚོ་ཆེན་པོ་མ་དྲོས་པ་ན། ཁ་ཅིག་ནི་རྫིང་བུ་དལ་གྱིས་འབབ་ན།
en: some at Lake Anavatapta, some along gently lapping ponds,

source: ཁ་ཅིག་ནི་རྣལ་འབྱོར་པའི་སྐྱེ་བོ་དང་རྗེས་སུ་མཐུན་པའི་གྲོང་དང་། གྲོང་རྡལ་དང་། ཡུལ་དང་།
en: nd some in villages, towns, regions,

source: ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གི་ཕྱོགས་དེ་དང་དེ་དག་ན་བསམ་གཏན་བྱེད་དོ། །
en: countryside, and kingdoms inhabited by like-minded yogis.

source: ཇི་ཙམ་ན་ཀླུ་གཞོན་ནུ་སྐྱེས་ནས་
en: “Meanwhile, a young nāga born not long before that

source: རིང་པོ་མ་ལོན་པ་ཞིག་འདབ་ཆགས་ཀྱི་རྒྱལ་པོ་འདབ་བཟངས་ཀྱིས་རི་རབ་ཀྱི་བང་རིམ་གྱི་སྟེང་དུ་དྲངས་པ་དང་།
en: was carried off to the top shelf of Mount Sumeru by the garūḍa Suparṇi.

source: ཇི་ཙམ་ན་དེས་དགེ་སློང་སྤྱོད་ལམ་ཞི་བས་བསམ་གཏན་དང་། ཀློག་པ་དང་། རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པ་དག་མཐོང་ངོ་།
en: In time, the young nāga saw monks of pacific bearing diligently practicing meditation, recitation, and yoga.

source: མཐོང་ནས་ཀྱང་དེའི་སེམས་མངོན་པར་དད་པར་གྱུར་ཏོ། །
en: Seeing them caused great faith to well up in his mind.

source: དེ་སེམས་དད་པ་སྐྱེས་ནས་
en: With his mind filled with faith,

source: སྙམ་དུ་སེམས་སྐྱེད་པར་བྱེད་ཅིང་།
en: it occurred to him,

source: འཕགས་པ་བདག་ཉིད་ཆེན་པོ་འདི་དག་ནི་སྡུག་བསྔལ་གྱི་བྱེ་བྲག་འདི་ལྟ་བུ་ལས་གྲོལ་བ་ཡིན་ནོ་
en: ‘These great and noble souls have been freed from sufferings such as mine.’

source: དེ་དེ་དག་ལ་སེམས་མངོན་པར་དད་པར་བྱས་ནས་དུས་ལ་བབ་པ་དང་།
en: The young nāga placed great faith in them, and eventually his time came,

source: ལས་དྲུག་ལ་བརྩོན་པའི་བྲམ་ཟེའི་ཁྱིམ་ཞིག་ཏུ་སྐྱེས་ནས་ཇི་ཙམ་ན་བསྲིངས་ཤིང་བསྐྱེད་དེ་ཆེན་པོར་གྱུར་ཏོ། །
en: after which he was born into a brahmin family dedicated to the six duties, and in time he grew up under their nurture and care.

source: དེ་དུས་གཞན་ཞིག་ན་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་ནས་
en: “He later went forth into the perfectly awakened and blessed Buddha Kāśyapa’s teachings and,

source: དེས་བརྩོན་པ་དང་། འབད་པ་དང་། བརྩལ་བས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་ཏེ།
en: through diligence, effort, and exertion, abandoned all disturbing emotions and actualized arhatship.

source: དབང་པོ་དང་། ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ། །
en: and esteem, and was revered, honored, and praised by Indra and the gods who attend him.

source: དེས་བསམས་པ། བདག་ག་ལས་ཤི་འཕོས། གང་དུ་སྐྱེས། ལས་གང་གིས་བྱས་སྙམ་ན།
en: “On wondering, ‘Whence have I come? Where have I been born? What actions led to this?’

source: དེས་དུད་འགྲོ་ནས་ཤི་འཕོས་ཤིང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་དང་།
en: he saw that he had been a creature who had died and passed on, had been born among humans,

source: ཉན་ཐོས་ཆེན་པོ་རྣམས་ལ་སེམས་མངོན་པར་དད་པར་བྱས་པས་སྐྱེས་པར་མཐོང་ངོ་། །
en: and that he had given rise to great faith in great disciples.

source: དེས་ཕ་མ་ལ་བསམས་ཏེ། བདག་གི་ཕ་མ་ག་ལ་འདུག་སྙམ་ན། ཀླུའི་གནས་ན་འདུག་པར་མཐོང་ངོ་། །
en: “He then thought of his mother and father from his previous life as a young nāga.

source: ཅི་བྱེད་སྙམ་ན། ཀླུའི་སྐྱེ་གནས་ན་ངུ་ཞིང་འདུག་པར་མཐོང་ནས་དེ་རྫུ་འཕྲུལ་གྱིས་དེར་སོང་སྟེ་དྲི་བར་བརྩམས་པ།
en: On wondering, ‘Where are my parents?’ he saw that they were among the nāgas.

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ། འཕགས་པ་བདག་ཅག་གི་ཀླུ་གཞོན་ནུ་
en: “They replied, ‘Noble one, our young nāga
